Lambda School Data Science

*Unit 1, Sprint 1, Module 3*

---

# Join and Reshape datasets

Objectives
- concatenate data with pandas
- merge data with pandas
-  understand tidy data formatting
-  melt and pivot data with pandas

Links
- [Pandas Cheat Sheet](https://github.com/pandas-dev/pandas/blob/master/doc/cheatsheet/Pandas_Cheat_Sheet.pdf)
- [Tidy Data](https://en.wikipedia.org/wiki/Tidy_data)
  - Combine Data Sets: Standard Joins
  - Tidy Data
  - Reshaping Data
- Python Data Science Handbook
  - [Chapter 3.6](https://jakevdp.github.io/PythonDataScienceHandbook/03.06-concat-and-append.html), Combining Datasets: Concat and Append
  - [Chapter 3.7](https://jakevdp.github.io/PythonDataScienceHandbook/03.07-merge-and-join.html), Combining Datasets: Merge and Join
  - [Chapter 3.8](https://jakevdp.github.io/PythonDataScienceHandbook/03.08-aggregation-and-grouping.html), Aggregation and Grouping
  - [Chapter 3.9](https://jakevdp.github.io/PythonDataScienceHandbook/03.09-pivot-tables.html), Pivot Tables
  
Reference
- Pandas Documentation: [Reshaping and Pivot Tables](https://pandas.pydata.org/pandas-docs/stable/reshaping.html)
- Modern Pandas, Part 5: [Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-10-30 21:08:49--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.217.38.222
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.217.38.222|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.1’

instacart_online_gr 100%[===================>] 196.03M  59.0MB/s    in 3.3s

2019-10-30 21:08:53 (59.0 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.1’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [4]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

# Assignment

## Join Data Practice

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

In [0]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt 
import seaborn as sns

In [0]:
aisles = pd.read_csv("aisles.csv")
departments = pd.read_csv("departments.csv")
order_products__prior = pd.read_csv("order_products__prior.csv")
order_products__train = pd.read_csv("order_products__train.csv")
orders = pd.read_csv("orders.csv")
products = pd.read_csv("products.csv")

In [0]:
# which columns do we need?

In [8]:
order_products = pd.concat([order_products__prior, order_products__train])
print(order_products.shape)
order_products.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [0]:
# we need order_id and product_id.

In [10]:
num_orders = pd.pivot_table(order_products, values="order_id", index=["product_id"], aggfunc=len)
num_orders.head()

            order_id
product_id
1               1928
2                 94
3                283
4                351
5                 16

In [11]:
num_orders = num_orders.sort_values("order_id", ascending=False)
num_orders.columns = ["order count",]
num_orders[:10]

            order count
product_id
24852            491291
13176            394930
21137            275577
21903            251705
47209            220877
47766            184224
47626            160792
16797            149445
26209            146660
27845            142813

In [12]:
orders.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [13]:
products.head(25)

    product_id  ... department_id
0            1  ...            19
1            2  ...            13
2            3  ...             7
3            4  ...             1
4            5  ...            13
5            6  ...            11
6            7  ...             7
7            8  ...             1
8            9  ...            16
9           10  ...             7
10          11  ...             7
11          12  ...             1
12          13  ...            11
13          14  ...            17
14          15  ...            18
15          16  ...            19
16          17  ...            12
17          18  ...             1
18          19  ...             9
19          20  ...             7
20          21  ...             8
21          22  ...            11
22          23  ...            12
23          24  ...            11
24          25  ...            19

[25 rows x 4 columns]

In [0]:
# we need product_id, product_name

In [15]:
num_product_ordered = num_orders.head(10).merge(products, how="inner", on="product_id")[["order count", "product_name",]]
num_product_ordered.head(20)

   order count            product_name
0       491291                  Banana
1       394930  Bag of Organic Bananas
2       275577    Organic Strawberries
3       251705    Organic Baby Spinach
4       220877    Organic Hass Avocado
5       184224         Organic Avocado
6       160792             Large Lemon
7       149445            Strawberries
8       146660                   Limes
9       142813      Organic Whole Milk

In [0]:
# there we have it

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [17]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-10-30 21:09:27--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.139.133
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.139.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.2’

instacart_online_gr 100%[===================>] 196.03M  94.5MB/s    in 2.1s

2019-10-30 21:09:29 (94.5 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz.2’ saved [205548478/205548478]

In [18]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [19]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01/instacart_2017_05_01

In [20]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

In [21]:
from IPython.display import display, Image
url = 'https://cdn-images-1.medium.com/max/1600/1*vYGFQCafJtGBBX5mbl0xyw.png'
example = Image(url=url, width=600)
display(example)

In [22]:
!ls -lh *csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

In [0]:
aisles = pd.read_csv("aisles.csv")
departments = pd.read_csv("departments.csv")
order_products__prior = pd.read_csv("order_products__prior.csv")
order_products__train = pd.read_csv("order_products__train.csv")
orders = pd.read_csv("orders.csv")
products = pd.read_csv("products.csv")

In [24]:
print(aisles.shape)
aisles.head()

(134, 2)

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [25]:
print(departments.shape)
departments.head()

(21, 2)

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [26]:
print(order_products__prior.shape)
order_products__prior.head()

(32434489, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [27]:
print(order_products__train.shape)
order_products__train.head()

(1384617, 4)

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [28]:
print(orders.shape)
orders.head()

(3421083, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [29]:
print(products.shape)
products.head()

(49688, 4)

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [30]:
order_products = pd.concat([order_products__prior, order_products__train,])
print(order_products.shape)
order_products.head()

(33819106, 4)

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [31]:
orders.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [32]:
order_products.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [33]:
condition = (orders["order_number"] <= 2) & (orders["user_id"] == 1)
print(orders[condition].shape)
orders[condition].head()

(2, 7)

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0

[2 rows x 7 columns]

In [0]:

columns = ['user_id', 
           'order_id', 
           'order_number', 
           'order_dow', 
           'order_hour_of_day']

orders_subset = orders.loc[condition, columns]

In [35]:
orders.head()

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [36]:
order_products.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [37]:
merged = order_products.merge(orders_subset, on="order_id")
print(merged.shape)
merged.head(25)

(11, 8)

    order_id  product_id  ...  order_dow  order_hour_of_day
0    2398795         196  ...          3                  7
1    2398795       10258  ...          3                  7
2    2398795       12427  ...          3                  7
3    2398795       13176  ...          3                  7
4    2398795       26088  ...          3                  7
5    2398795       13032  ...          3                  7
6    2539329         196  ...          2                  8
7    2539329       14084  ...          2                  8
8    2539329       12427  ...          2                  8
9    2539329       26088  ...          2                  8
10   2539329       26405  ...          2                  8

[11 rows x 8 columns]

In [38]:
merged = merged.merge(products, how="inner", on="product_id")
print(merged.shape)
merged.head(25)

(11, 11)

    order_id  product_id  ...  aisle_id  department_id
0    2398795         196  ...        77              7
1    2539329         196  ...        77              7
2    2398795       10258  ...       117             19
3    2398795       12427  ...        23             19
4    2539329       12427  ...        23             19
5    2398795       13176  ...        24              4
6    2398795       26088  ...        23             19
7    2539329       26088  ...        23             19
8    2398795       13032  ...       121             14
9    2539329       14084  ...        91             16
10   2539329       26405  ...        54             17

[11 rows x 11 columns]

In [39]:
final = merged.sort_values(by=["order_number", "add_to_cart_order"])
final.columns = [column.replace("_", " ") for column in final]
final.head()

    order id  product id  ...  aisle id  department id
1    2539329         196  ...        77              7
9    2539329       14084  ...        91             16
4    2539329       12427  ...        23             19
7    2539329       26088  ...        23             19
10   2539329       26405  ...        54             17

[5 rows x 11 columns]

In [0]:
flights = sns.load_dataset('flights')

In [0]:
# Load seaborn's flights dataset by running the cell below.
# Then create a pivot table showing the number of passengers
# by month and year. Use year for the index and month for the
# columns. You've done it right if you get 112 passengers for
# January 1949 and 432 passengers for December 1960.

In [42]:
print(flights.shape)
flights.head()

(144, 3)

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [0]:
flights_pivot = pd.pivot_table(flights, values="passengers", index=["year", "month"], aggfunc=np.sum)

In [44]:
flights_pivot.head(12)

                passengers
year month
1949 January           112
     February          118
     March             132
     April             129
     May               121
     June              135
     July              148
     August            148
     September         136
     October           119
     November          104
     December          118

In [45]:
flights_pivot.loc[1960, "December"]

passengers    432
Name: (1960, December), dtype: int64

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

In [0]:
order_product_counts = order_products["product_id"].value_counts()

In [47]:
type(order_product_counts)

pandas.core.series.Series

In [0]:
popular = order_product_counts[order_product_counts > 2900].index

In [49]:
popular_products = order_products[order_products["product_id"].isin(popular)]
popular_products.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
5         2       17794                  6          1
9         3       33754                  1          1

In [0]:
merged = popular_products.merge(orders, how="inner", on="order_id")

In [51]:
merged.head()

   order_id  product_id  ...  order_hour_of_day  days_since_prior_order
0         2       33120  ...                  9                     8.0
1         2       28985  ...                  9                     8.0
2         2        9327  ...                  9                     8.0
3         2       17794  ...                  9                     8.0
4         3       33754  ...                 17                    12.0

[5 rows x 10 columns]

In [0]:
merged = merged.pivot_table(values="order_hour_of_day", index="product_id", aggfunc=np.mean)

In [0]:
products_by_hour = merged.sort_values(by="order_hour_of_day", ascending=False).head(25)

In [64]:
products.merge(products_by_hour, how="inner", on="product_id").sort_values(by="order_hour_of_day")

    product_id  ... order_hour_of_day
10       27179  ...         14.027699
1         4932  ...         14.039406
17       41319  ...         14.083895
2         8638  ...         14.104662
9        22620  ...         14.120449
15       38563  ...         14.134992
22       47652  ...         14.156069
0         2361  ...         14.189235
3        12276  ...         14.204325
4        13885  ...         14.224069
7        20754  ...         14.233542
18       45368  ...         14.248191
6        17334  ...         14.256280
8        21463  ...         14.257849
16       40002  ...         14.268841
23       47993  ...         14.270300
24       48523  ...         14.292018
11       28682  ...         14.303480
13       38003  ...         14.306421
14       38374  ...         14.369711
5        14335  ...         14.373308
21       46175  ...         14.388942
20       45681  ...         14.394912
19       45541  ...         14.526299
12       30668  ...         14.526986

[25 rows x 5 columns]

In [0]:
# looks good

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)

In [0]:
##### YOUR CODE HERE #####